Autodesk.Revit.DB.ExternalResourceLoadData.SetExternalResourceReference(Autodesk.Revit.DB.ExternalResourceReference)
Returns the ExternalResourceReference resulting from this load operation.
Remarks:
This object contains the ExternalResourceReference produced by the loading operation onIExternalResourceServer.
resourceRef:
A reference to an ExternalResourceReference object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.ExternalResourceLoadData.GetLoadContext
Returns an object containing information about the context of the load operation.
Returns:
An object containing information about the context of the load operation.
Since:
2015

Autodesk.Revit.DB.ExternalResourceLoadData.GetLoadRequestId
Returns the load operation GUID.
Remarks:
This Id uniquely identifies the load request. IExternalResourceServers can use it as a key to store
and retrieve information (such as errors) that is relevant to a specific load operation.
Returns:
The load operation GUID.
Since:
2015

Autodesk.Revit.DB.ExternalResourceLoadData.GetLoadContent
Returns the ExternalResourceLoadContent resulting from this load operation.
Remarks:
This object contains the content produced by the call to the IExternalResourceServer's
LoadResource method.
Returns:
A reference to an ExternalResourceLoadContent object.
Since:
2015

Autodesk.Revit.DB.ExternalResourceLoadData.GetExternalResourceReference
Returns the ExternalResourceReference that identifies which resource should be loaded.
Remarks:
Information in this object tells the server from which specific resource Revit
expects to receive the external data.
Since:
2015

Autodesk.Revit.DB.ExternalResourceLoadData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ExternalResourceLoadData.LoadStatus
The success or failure status of the load attempt.
Since:
2015

Autodesk.Revit.DB.ExternalResourceLoadData.ExternalResourceType
The ExternalResourceType for which Revit is requesting data from the server.
Since:
2015

Autodesk.Revit.DB.ExternalResourceLoadData.ErrorsReported
Indicates whether the IExternalResourceUIServer has reported errors
for this ExternalResourceLoadData. This value can be set by the
IExternalResourceUIServer in HandleLoadResourceResults().
Remarks:
For Revit links specifically, Revit will check this value to see
if it should report errors about a given link in the Unresolved
References dialog. An IExternalResourceUIServer can set this value
to true to avoid redundant messages.
Note that it is possible for Revit to encounter errors internally
even if the server successfully provides a reference. In general, this
value should only be set to true if the server has reported an
error condition.
Since:
2015

Autodesk.Revit.DB.ExternalResourceLoadData.#ctor(Autodesk.Revit.DB.ExternalResourceLoadData)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.ExternalResourceLoadData
This class contains the input and output data resulting from invoking an IExternalResourceServer's LoadResource method.
After the call to LoadResource, the resulting ExternalResourceLoadData will be passed into
IExternalResourceServer.HandleLoadResourceResults() so that appropriate UI can be displayed.
Server providers can inspect the ExternalResourceLoadData to get an ExternalResourceLoadContent
object of the subclass appropriate to the external resource. The class also contains a copy of the
ExternalResourceReference, and information about the context of the load operation.
Since:
2015